RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7s3xx.h
#define DCMIPP_NUM_OF_PIPES 0x1U
/*******************  Bit definition for DCMIPP_IPGR1 register  ***************/
#define DCMIPP_IPGR1_MEMORYPAGE_Pos    (0U)
#define DCMIPP_IPGR1_MEMORYPAGE_Msk    (0x7UL << DCMIPP_IPGR1_MEMORYPAGE_Pos)  /*!< 0x00000007 */
#define DCMIPP_IPGR1_MEMORYPAGE        DCMIPP_IPGR1_MEMORYPAGE_Msk             /*!< MEMORYPAGE[2:0] */
#define DCMIPP_IPGR1_QOS_MODE_Pos      (24U)
#define DCMIPP_IPGR1_QOS_MODE_Msk      (0x1UL << DCMIPP_IPGR1_QOS_MODE_Pos)    /*!< 0x01000000 */
#define DCMIPP_IPGR1_QOS_MODE          DCMIPP_IPGR1_QOS_MODE_Msk               /*!< Quality Of Service */

/*******************  Bit definition for DCMIPP_IPGR2 register  ***************/
#define DCMIPP_IPGR2_PSTART_Pos        (0U)
#define DCMIPP_IPGR2_PSTART_Msk        (0x1UL << DCMIPP_IPGR2_PSTART_Pos)      /*!< 0x00000001 */
#define DCMIPP_IPGR2_PSTART            DCMIPP_IPGR2_PSTART_Msk                 /*!< request to lock the IP-Plug */

/*******************  Bit definition for DCMIPP_IPGR3 register  ***************/
#define DCMIPP_IPGR3_IDLE_Pos          (0U)
#define DCMIPP_IPGR3_IDLE_Msk          (0x1UL << DCMIPP_IPGR3_IDLE_Pos)        /*!< 0x00000001 */
#define DCMIPP_IPGR3_IDLE              DCMIPP_IPGR3_IDLE_Msk                   /*!< request to lock the IP-Plug */

/*******************  Bit definition for DCMIPP_IPGR8 register  ***************/
#define DCMIPP_IPGR8_DID_Pos           (0U)
#define DCMIPP_IPGR8_DID_Msk           (0x3FUL << DCMIPP_IPGR8_DID_Pos)        /*!< 0x0000003F */
#define DCMIPP_IPGR8_DID               DCMIPP_IPGR8_DID_Msk                    /*!< DID[5:0]: division identifier */
#define DCMIPP_IPGR8_REVID_Pos         (8U)
#define DCMIPP_IPGR8_REVID_Msk         (0x1FUL << DCMIPP_IPGR8_REVID_Pos)      /*!< 0x00001F00 */
#define DCMIPP_IPGR8_REVID             DCMIPP_IPGR8_REVID_Msk                  /*!< REVID[4:0]: revision identifier */
#define DCMIPP_IPGR8_ARCHIID_Pos       (16U)
#define DCMIPP_IPGR8_ARCHIID_Msk       (0x1FUL << DCMIPP_IPGR8_ARCHIID_Pos)    /*!< 0x001F0000 */
#define DCMIPP_IPGR8_ARCHIID           DCMIPP_IPGR8_ARCHIID_Msk                /*!< ARCHIID[4:0]: architecture identifier */
#define DCMIPP_IPGR8_IPID_Pos          (24U)
#define DCMIPP_IPGR8_IPID_Msk          (0xFFUL << DCMIPP_IPGR8_IPID_Pos)       /*!< 0xFF000000 */
#define DCMIPP_IPGR8_IPID              DCMIPP_IPGR8_IPID_Msk                   /*!< IPPID[7:0]: IP identifier */

/*******************  Bit definition for DCMIPP_IPC1R1 register  **************/
#define DCMIPP_IPC1R1_TRAFFIC_Pos      (0U)
#define DCMIPP_IPC1R1_TRAFFIC_Msk      (0x7UL << DCMIPP_IPC1R1_TRAFFIC_Pos)    /*!< 0x00000007 */
#define DCMIPP_IPC1R1_TRAFFIC          DCMIPP_IPC1R1_TRAFFIC_Msk               /*!< TRAFFIC[2:0] */
#define DCMIPP_IPC1R1_OTR_Pos          (8U)
#define DCMIPP_IPC1R1_OTR_Msk          (0x3UL << DCMIPP_IPC1R1_OTR_Pos)        /*!< 0x00000300 */
#define DCMIPP_IPC1R1_OTR              DCMIPP_IPC1R1_OTR_Msk                   /*!< OTR[1:0]: max outstanding transactions */

/*******************  Bit definition for DCMIPP_IPC1R2 register  **************/
#define DCMIPP_IPC1R2_WLRU_Pos         (16U)
#define DCMIPP_IPC1R2_WLRU_Msk         (0xFUL << DCMIPP_IPC1R2_WLRU_Pos)       /*!< 0x000F0000 */
#define DCMIPP_IPC1R2_WLRU             DCMIPP_IPC1R2_WLRU_Msk                  /*!< WLRU[3:0]: ratio for WLRU[3:0] arbitration */

/*******************  Bit definition for DCMIPP_IPC1R3 register  **************/
#define DCMIPP_IPC1R3_DPREGSTART_Pos   (0U)
#define DCMIPP_IPC1R3_DPREGSTART_Msk   (0x1FUL << DCMIPP_IPC1R3_DPREGSTART_Pos) /*!< 0x0000001F */
#define DCMIPP_IPC1R3_DPREGSTART       DCMIPP_IPC1R3_DPREGSTART_Msk            /*!< DPREGSTART[4:0]: start word */
#define DCMIPP_IPC1R3_DPREGEND_Pos     (16U)
#define DCMIPP_IPC1R3_DPREGEND_Msk     (0x1FUL << DCMIPP_IPC1R3_DPREGEND_Pos)  /*!< 0x001F0000 */
#define DCMIPP_IPC1R3_DPREGEND         DCMIPP_IPC1R3_DPREGEND_Msk              /*!< DPREGEND[4:0]: end word */

/*******************  Bit definition for DCMIPP_PRCR register  ****************/
#define DCMIPP_PRCR_ESS_Pos            (4U)
#define DCMIPP_PRCR_ESS_Msk            (0x1UL << DCMIPP_PRCR_ESS_Pos)          /*!< 0x00000010 */
#define DCMIPP_PRCR_ESS                DCMIPP_PRCR_ESS_Msk                     /*!< Embedded synchronization select */
#define DCMIPP_PRCR_PCKPOL_Pos         (5U)
#define DCMIPP_PRCR_PCKPOL_Msk         (0x1UL << DCMIPP_PRCR_PCKPOL_Pos)       /*!< 0x00000020 */
#define DCMIPP_PRCR_PCKPOL             DCMIPP_PRCR_PCKPOL_Msk                  /*!< Pixel clock polarity */
#define DCMIPP_PRCR_HSPOL_Pos          (6U)
#define DCMIPP_PRCR_HSPOL_Msk          (0x1UL << DCMIPP_PRCR_HSPOL_Pos)        /*!< 0x00000040 */
#define DCMIPP_PRCR_HSPOL              DCMIPP_PRCR_HSPOL_Msk                   /*!< Horizontal synchronization polarity */
#define DCMIPP_PRCR_VSPOL_Pos          (7U)
#define DCMIPP_PRCR_VSPOL_Msk          (0x1UL << DCMIPP_PRCR_VSPOL_Pos)        /*!< 0x00000080 */
#define DCMIPP_PRCR_VSPOL              DCMIPP_PRCR_VSPOL_Msk                   /*!< Vertical synchronization polarity */
#define DCMIPP_PRCR_EDM_Pos            (10U)
#define DCMIPP_PRCR_EDM_Msk            (0x7UL << DCMIPP_PRCR_EDM_Pos)          /*!< 0x00001C00 */
#define DCMIPP_PRCR_EDM                DCMIPP_PRCR_EDM_Msk                     /*!< EDM[2:0]: Extended data mode */
#define DCMIPP_PRCR_ENABLE_Pos         (14U)
#define DCMIPP_PRCR_ENABLE_Msk         (0x1UL << DCMIPP_PRCR_ENABLE_Pos)       /*!< 0x00004000 */
#define DCMIPP_PRCR_ENABLE             DCMIPP_PRCR_ENABLE_Msk                  /*!< Parallel Interface enable */
#define DCMIPP_PRCR_FORMAT_Pos         (16U)
#define DCMIPP_PRCR_FORMAT_Msk         (0xFFUL << DCMIPP_PRCR_FORMAT_Pos)      /*!< 0x00FF0000 */
#define DCMIPP_PRCR_FORMAT             DCMIPP_PRCR_FORMAT_Msk                  /*!< FORMAT[7:0] */
#define DCMIPP_PRCR_SWAPCYCLES_Pos     (25U)
#define DCMIPP_PRCR_SWAPCYCLES_Msk     (0x1UL << DCMIPP_PRCR_SWAPCYCLES_Pos)   /*!< 0x02000000 */
#define DCMIPP_PRCR_SWAPCYCLES         DCMIPP_PRCR_SWAPCYCLES_Msk              /*!< swap data */
#define DCMIPP_PRCR_SWAPBITS_Pos       (26U)
#define DCMIPP_PRCR_SWAPBITS_Msk       (0x1UL << DCMIPP_PRCR_SWAPBITS_Pos)     /*!< 0x04000000 */
#define DCMIPP_PRCR_SWAPBITS           DCMIPP_PRCR_SWAPBITS_Msk                /*!< swap lsb vs msb */

