RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7s3xx.h
#define PWR_WKUPEPR_WKUPPUPD1_Pos      (16U)
#define PWR_WKUPEPR_WKUPPUPD1_Msk      (0x3UL << PWR_WKUPEPR_WKUPPUPD1_Pos)    /*!< 0x00030000 */
#define PWR_WKUPEPR_WKUPPUPD1          PWR_WKUPEPR_WKUPPUPD1_Msk               /*!< Wakeup Pin pull configuration for WKUP1 */
#define PWR_WKUPEPR_WKUPPUPD1_0        (0x1UL << PWR_WKUPEPR_WKUPPUPD1_Pos)     /*!< 0x00010000 */
#define PWR_WKUPEPR_WKUPPUPD1_1        (0x2UL << PWR_WKUPEPR_WKUPPUPD1_Pos)     /*!< 0x00020000 */
#define PWR_WKUPEPR_WKUPPUPD2_Pos      (18U)
#define PWR_WKUPEPR_WKUPPUPD2_Msk      (0x3UL << PWR_WKUPEPR_WKUPPUPD2_Pos)    /*!< 0x000C0000 */
#define PWR_WKUPEPR_WKUPPUPD2          PWR_WKUPEPR_WKUPPUPD2_Msk               /*!< Wakeup Pin pull configuration for WKUP2 */
#define PWR_WKUPEPR_WKUPPUPD2_0        (0x1UL << PWR_WKUPEPR_WKUPPUPD2_Pos)     /*!< 0x00040000 */
#define PWR_WKUPEPR_WKUPPUPD2_1        (0x2UL << PWR_WKUPEPR_WKUPPUPD2_Pos)     /*!< 0x00080000 */
#define PWR_WKUPEPR_WKUPPUPD3_Pos      (20U)
#define PWR_WKUPEPR_WKUPPUPD3_Msk      (0x3UL << PWR_WKUPEPR_WKUPPUPD3_Pos)    /*!< 0x00300000 */
#define PWR_WKUPEPR_WKUPPUPD3          PWR_WKUPEPR_WKUPPUPD3_Msk               /*!< Wakeup Pin pull configuration for WKUP3 */
#define PWR_WKUPEPR_WKUPPUPD3_0        (0x1UL << PWR_WKUPEPR_WKUPPUPD3_Pos)     /*!< 0x00100000 */
#define PWR_WKUPEPR_WKUPPUPD3_1        (0x2UL << PWR_WKUPEPR_WKUPPUPD3_Pos)     /*!< 0x00200000 */
#define PWR_WKUPEPR_WKUPPUPD4_Pos      (22U)
#define PWR_WKUPEPR_WKUPPUPD4_Msk      (0x3UL << PWR_WKUPEPR_WKUPPUPD4_Pos)    /*!< 0x00C00000 */
#define PWR_WKUPEPR_WKUPPUPD4          PWR_WKUPEPR_WKUPPUPD4_Msk               /*!< Wakeup Pin pull configuration for WKUP4 */
#define PWR_WKUPEPR_WKUPPUPD4_0        (0x1UL << PWR_WKUPEPR_WKUPPUPD4_Pos)     /*!< 0x00400000 */
#define PWR_WKUPEPR_WKUPPUPD4_1        (0x2UL << PWR_WKUPEPR_WKUPPUPD4_Pos)     /*!< 0x00800000 */

/********************  Bit definition for PWR_UCPDRR register   ********************/
#define PWR_UCPDR_UCPD_DBDIS_Pos       (0U)
#define PWR_UCPDR_UCPD_DBDIS_Msk       (0x1UL << PWR_UCPDR_UCPD_DBDIS_Pos)     /*!< 0x00000001 */
#define PWR_UCPDR_UCPD_DBDIS           PWR_UCPDR_UCPD_DBDIS_Msk                /*!< UCPD dead battery disable */

#define PWR_UCPDR_UCPD_STBY_Pos        (1U)
#define PWR_UCPDR_UCPD_STBY_Msk        (0x1UL << PWR_UCPDR_UCPD_STBY_Pos)      /*!< 0x00000002 */
#define PWR_UCPDR_UCPD_STBY            PWR_UCPDR_UCPD_STBY_Msk                 /*!< UCPD Standby mode */

/********************  Bit definition for PWR_APCR  register  ********************/
#define PWR_APCR_APC_Pos               (0U)
#define PWR_APCR_APC_Msk               (0x1UL << PWR_APCR_APC_Pos)             /*!< 0x00000001 */
#define PWR_APCR_APC                   PWR_APCR_APC_Msk                        /*!< Apply pull configuration register */

#define PWR_APCR_PN7_PUPD_Pos          (16U)
#define PWR_APCR_PN7_PUPD_Msk          (0x1UL << PWR_APCR_PN7_PUPD_Pos)        /*!< 0x00010000 */
#define PWR_APCR_PN7_PUPD              PWR_APCR_PN7_PUPD_Msk                   /*!< Port N bit 7 pull-up/down configuration */

#define PWR_APCR_PO5_PUPD_Pos          (17)
#define PWR_APCR_PO5_PUPD_Msk          (0x1UL << PWR_APCR_PO5_PUPD_Pos)        /*!< 0x00020000 */
#define PWR_APCR_PO5_PUPD              PWR_APCR_PO5_PUPD_Msk                   /*!< Port O bit 5 pull-up/down configuration */

#define PWR_APCR_I3CPB6_PU_Pos         (28U)
#define PWR_APCR_I3CPB6_PU_Msk         (0x1UL << PWR_APCR_I3CPB6_PU_Pos)      /*!< 0x10000000 */
#define PWR_APCR_I3CPB6_PU             PWR_APCR_I3CPB6_PU_Msk                 /*!< Port PB6 I3C pull-up bit configuration */

#define PWR_APCR_I3CPB7_PU_Pos         (29U)
#define PWR_APCR_I3CPB7_PU_Msk         (0x1UL << PWR_APCR_I3CPB7_PU_Pos)      /*!< 0x20000000 */
#define PWR_APCR_I3CPB7_PU             PWR_APCR_I3CPB7_PU_Msk                 /*!< Port PB7 I3C pull-up bit configuration */

#define PWR_APCR_I3CPB8_PU_Pos         (30U)
#define PWR_APCR_I3CPB8_PU_Msk         (0x1UL << PWR_APCR_I3CPB8_PU_Pos)      /*!< 0x40000000 */
#define PWR_APCR_I3CPB8_PU             PWR_APCR_I3CPB8_PU_Msk                 /*!< Port PB8 I3C pull-up bit configuration */

#define PWR_APCR_I3CPB9_PU_Pos         (31U)
#define PWR_APCR_I3CPB9_PU_Msk         (0x1UL << PWR_APCR_I3CPB9_PU_Pos)      /*!< 0x80000000 */
#define PWR_APCR_I3CPB9_PU             PWR_APCR_I3CPB9_PU_Msk                 /*!< Port PB9 I3C pull-up bit configuration */

/********************  Bit definition for PWR_PUCRN  register  ********************/
#define PWR_PUCRN_PUN1_Pos             (1U)
#define PWR_PUCRN_PUN1_Msk             (0x1UL << PWR_PUCRN_PUN1_Pos)           /*!< 0x00000002 */
#define PWR_PUCRN_PUN1                 PWR_PUCRN_PUN1_Msk                      /*!< PUN1: Port N pull-up */

#define PWR_PUCRN_PUN6_Pos             (6U)
#define PWR_PUCRN_PUN6_Msk             (0x1UL << PWR_PUCRN_PUN6_Pos)           /*!< 0x00000040 */
#define PWR_PUCRN_PUN6                 PWR_PUCRN_PUN6_Msk                      /*!< PUN6: Port N pull-up */

#define PWR_PUCRN_PUN12_Pos            (12U)
#define PWR_PUCRN_PUN12_Msk            (0x1UL << PWR_PUCRN_PUN12_Pos)          /*!< 0x00001000 */
#define PWR_PUCRN_PUN12                PWR_PUCRN_PUN12_Msk                     /*!< PUN12: Port N pull-up */

/********************  Bit definition for PWR_PDCRN  register  ********************/
#define PWR_PDCRN_PDN0_Pos             (0U)
#define PWR_PDCRN_PDN0_Msk             (0x1UL << PWR_PDCRN_PDN0_Pos)           /*!< 0x00000001 */
#define PWR_PDCRN_PDN0                 PWR_PDCRN_PDN0_Msk                      /*!< PDN0: Port N pull-down */

#define PWR_PDCRN_PDN1_Pos             (1U)
#define PWR_PDCRN_PDN1_Msk             (0x1UL << PWR_PDCRN_PDN1_Pos)           /*!< 0x00000002 */
#define PWR_PDCRN_PDN1                 PWR_PDCRN_PDN1_Msk                      /*!< PDN1: Port N pull-down */

#define PWR_PDCRN_PDN2N5_Pos           (2U)
#define PWR_PDCRN_PDN2N5_Msk           (0x1UL << PWR_PDCRN_PDN2N5_Pos)         /*!< 0x00000004 */
#define PWR_PDCRN_PDN2N5               PWR_PDCRN_PDN2N5_Msk                    /*!< PDN2 to PDN5: Port N pull-down */

