RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7s3xx.h
#define RCC_BDCR_RTCEN_Pos             (15U)
#define RCC_BDCR_RTCEN_Msk             (0x1UL << RCC_BDCR_RTCEN_Pos)           /*!< 0x00008000 */
#define RCC_BDCR_RTCEN                 RCC_BDCR_RTCEN_Msk
#define RCC_BDCR_VSWRST_Pos            (16U)
#define RCC_BDCR_VSWRST_Msk            (0x1UL << RCC_BDCR_VSWRST_Pos)          /*!< 0x00010000 */
#define RCC_BDCR_VSWRST                RCC_BDCR_VSWRST_Msk

/********************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSION_Pos              (0U)
#define RCC_CSR_LSION_Msk              (0x1UL << RCC_CSR_LSION_Pos)            /*!< 0x00000001 */
#define RCC_CSR_LSION                  RCC_CSR_LSION_Msk
#define RCC_CSR_LSIRDY_Pos             (1U)
#define RCC_CSR_LSIRDY_Msk             (0x1UL << RCC_CSR_LSIRDY_Pos)           /*!< 0x00000002 */
#define RCC_CSR_LSIRDY                 RCC_CSR_LSIRDY_Msk

/********************  Bit definition for RCC_AHB1RSTR register  **************/
#define RCC_AHB1RSTR_GPDMA1RST_Pos     (4U)
#define RCC_AHB1RSTR_GPDMA1RST_Msk     (0x1UL << RCC_AHB1RSTR_GPDMA1RST_Pos)   /*!< 0x00000010 */
#define RCC_AHB1RSTR_GPDMA1RST         RCC_AHB1RSTR_GPDMA1RST_Msk
#define RCC_AHB1RSTR_ADC12RST_Pos      (5U)
#define RCC_AHB1RSTR_ADC12RST_Msk      (0x1UL << RCC_AHB1RSTR_ADC12RST_Pos)    /*!< 0x00000020 */
#define RCC_AHB1RSTR_ADC12RST          RCC_AHB1RSTR_ADC12RST_Msk
#define RCC_AHB1RSTR_ETH1RST_Pos       (15U)
#define RCC_AHB1RSTR_ETH1RST_Msk       (0x1UL << RCC_AHB1RSTR_ETH1RST_Pos)     /*!< 0x00008000 */
#define RCC_AHB1RSTR_ETH1RST            RCC_AHB1RSTR_ETH1RST_Msk
#define RCC_AHB1RSTR_OTGHSRST_Pos      (25U)
#define RCC_AHB1RSTR_OTGHSRST_Msk      (0x1UL << RCC_AHB1RSTR_OTGHSRST_Pos)    /*!< 0x02000000 */
#define RCC_AHB1RSTR_OTGHSRST          RCC_AHB1RSTR_OTGHSRST_Msk
#define RCC_AHB1RSTR_USBPHYCRST_Pos    (26U)
#define RCC_AHB1RSTR_USBPHYCRST_Msk    (0x1UL << RCC_AHB1RSTR_USBPHYCRST_Pos)  /*!< 0x04000000 */
#define RCC_AHB1RSTR_USBPHYCRST        RCC_AHB1RSTR_USBPHYCRST_Msk
#define RCC_AHB1RSTR_OTGFSRST_Pos      (27U)
#define RCC_AHB1RSTR_OTGFSRST_Msk      (0x1UL << RCC_AHB1RSTR_OTGFSRST_Pos)    /*!< 0x08000000 */
#define RCC_AHB1RSTR_OTGFSRST          RCC_AHB1RSTR_OTGFSRST_Msk
#define RCC_AHB1RSTR_ADF1RST_Pos       (31U)
#define RCC_AHB1RSTR_ADF1RST_Msk       (0x1UL << RCC_AHB1RSTR_ADF1RST_Pos)     /*!< 0x80000000 */
#define RCC_AHB1RSTR_ADF1RST           RCC_AHB1RSTR_ADF1RST_Msk

/********************  Bit definition for RCC_AHB2RSTR register  **************/
#define RCC_AHB2RSTR_PSSIRST_Pos       (1U)
#define RCC_AHB2RSTR_PSSIRST_Msk       (0x1UL << RCC_AHB2RSTR_PSSIRST_Pos)     /*!< 0x00000002 */
#define RCC_AHB2RSTR_PSSIRST           RCC_AHB2RSTR_PSSIRST_Msk
#define RCC_AHB2RSTR_SDMMC2RST_Pos     (9U)
#define RCC_AHB2RSTR_SDMMC2RST_Msk     (0x1UL << RCC_AHB2RSTR_SDMMC2RST_Pos)   /*!< 0x00000200 */
#define RCC_AHB2RSTR_SDMMC2RST         RCC_AHB2RSTR_SDMMC2RST_Msk
#define RCC_AHB2RSTR_CORDICRST_Pos     (14U)
#define RCC_AHB2RSTR_CORDICRST_Msk     (0x1UL << RCC_AHB2RSTR_CORDICRST_Pos)   /*!< 0x00004000 */
#define RCC_AHB2RSTR_CORDICRST         RCC_AHB2RSTR_CORDICRST_Msk

/********************  Bit definition for RCC_AHB3RSTR register  **************/
#define RCC_AHB3RSTR_RNGRST_Pos        (0U)
#define RCC_AHB3RSTR_RNGRST_Msk        (0x1UL << RCC_AHB3RSTR_RNGRST_Pos)      /*!< 0x00000001 */
#define RCC_AHB3RSTR_RNGRST            RCC_AHB3RSTR_RNGRST_Msk
#define RCC_AHB3RSTR_HASHRST_Pos       (1U)
#define RCC_AHB3RSTR_HASHRST_Msk       (0x1UL << RCC_AHB3RSTR_HASHRST_Pos)     /*!< 0x00000002 */
#define RCC_AHB3RSTR_HASHRST           RCC_AHB3RSTR_HASHRST_Msk
#define RCC_AHB3RSTR_CRYPRST_Pos       (2U)
#define RCC_AHB3RSTR_CRYPRST_Msk       (0x1UL << RCC_AHB3RSTR_CRYPRST_Pos)     /*!< 0x00000004 */
#define RCC_AHB3RSTR_CRYPRST           RCC_AHB3RSTR_CRYPRST_Msk
#define RCC_AHB3RSTR_SAESRST_Pos       (4U)
#define RCC_AHB3RSTR_SAESRST_Msk       (0x1UL << RCC_AHB3RSTR_SAESRST_Pos)     /*!< 0x00000010 */
#define RCC_AHB3RSTR_SAESRST           RCC_AHB3RSTR_SAESRST_Msk
#define RCC_AHB3RSTR_PKARST_Pos        (6U)
#define RCC_AHB3RSTR_PKARST_Msk        (0x1UL << RCC_AHB3RSTR_PKARST_Pos)      /*!< 0x00000040 */
#define RCC_AHB3RSTR_PKARST            RCC_AHB3RSTR_PKARST_Msk

/********************  Bit definition for RCC_AHB4RSTR register  **************/
#define RCC_AHB4RSTR_GPIOARST_Pos      (0U)
#define RCC_AHB4RSTR_GPIOARST_Msk      (0x1UL << RCC_AHB4RSTR_GPIOARST_Pos)    /*!< 0x00000001 */
#define RCC_AHB4RSTR_GPIOARST          RCC_AHB4RSTR_GPIOARST_Msk
#define RCC_AHB4RSTR_GPIOBRST_Pos      (1U)
#define RCC_AHB4RSTR_GPIOBRST_Msk      (0x1UL << RCC_AHB4RSTR_GPIOBRST_Pos)    /*!< 0x00000002 */
#define RCC_AHB4RSTR_GPIOBRST          RCC_AHB4RSTR_GPIOBRST_Msk
#define RCC_AHB4RSTR_GPIOCRST_Pos      (2U)
#define RCC_AHB4RSTR_GPIOCRST_Msk      (0x1UL << RCC_AHB4RSTR_GPIOCRST_Pos)    /*!< 0x00000004 */
#define RCC_AHB4RSTR_GPIOCRST          RCC_AHB4RSTR_GPIOCRST_Msk
#define RCC_AHB4RSTR_GPIODRST_Pos      (3U)
#define RCC_AHB4RSTR_GPIODRST_Msk      (0x1UL << RCC_AHB4RSTR_GPIODRST_Pos)    /*!< 0x00000008 */
#define RCC_AHB4RSTR_GPIODRST          RCC_AHB4RSTR_GPIODRST_Msk
#define RCC_AHB4RSTR_GPIOERST_Pos      (4U)
#define RCC_AHB4RSTR_GPIOERST_Msk      (0x1UL << RCC_AHB4RSTR_GPIOERST_Pos)    /*!< 0x00000010 */
#define RCC_AHB4RSTR_GPIOERST          RCC_AHB4RSTR_GPIOERST_Msk
#define RCC_AHB4RSTR_GPIOFRST_Pos      (5U)
#define RCC_AHB4RSTR_GPIOFRST_Msk      (0x1UL << RCC_AHB4RSTR_GPIOFRST_Pos)    /*!< 0x00000020 */
#define RCC_AHB4RSTR_GPIOFRST          RCC_AHB4RSTR_GPIOFRST_Msk
#define RCC_AHB4RSTR_GPIOGRST_Pos      (6U)
#define RCC_AHB4RSTR_GPIOGRST_Msk      (0x1UL << RCC_AHB4RSTR_GPIOGRST_Pos)    /*!< 0x00000040 */
#define RCC_AHB4RSTR_GPIOGRST          RCC_AHB4RSTR_GPIOGRST_Msk
#define RCC_AHB4RSTR_GPIOHRST_Pos      (7U)
#define RCC_AHB4RSTR_GPIOHRST_Msk      (0x1UL << RCC_AHB4RSTR_GPIOHRST_Pos)    /*!< 0x00000080 */
#define RCC_AHB4RSTR_GPIOHRST          RCC_AHB4RSTR_GPIOHRST_Msk
#define RCC_AHB4RSTR_GPIOMRST_Pos      (12U)
#define RCC_AHB4RSTR_GPIOMRST_Msk      (0x1UL << RCC_AHB4RSTR_GPIOMRST_Pos)    /*!< 0x00001000 */
#define RCC_AHB4RSTR_GPIOMRST          RCC_AHB4RSTR_GPIOMRST_Msk
#define RCC_AHB4RSTR_GPIONRST_Pos      (13U)
#define RCC_AHB4RSTR_GPIONRST_Msk      (0x1UL << RCC_AHB4RSTR_GPIONRST_Pos)    /*!< 0x00002000 */
#define RCC_AHB4RSTR_GPIONRST          RCC_AHB4RSTR_GPIONRST_Msk
#define RCC_AHB4RSTR_GPIOORST_Pos      (14U)
#define RCC_AHB4RSTR_GPIOORST_Msk      (0x1UL << RCC_AHB4RSTR_GPIOORST_Pos)    /*!< 0x00004000 */
#define RCC_AHB4RSTR_GPIOORST          RCC_AHB4RSTR_GPIOORST_Msk
#define RCC_AHB4RSTR_GPIOPRST_Pos      (15U)
#define RCC_AHB4RSTR_GPIOPRST_Msk      (0x1UL << RCC_AHB4RSTR_GPIOPRST_Pos)    /*!< 0x00008000 */
#define RCC_AHB4RSTR_GPIOPRST          RCC_AHB4RSTR_GPIOPRST_Msk
#define RCC_AHB4RSTR_CRCRST_Pos        (19U)
#define RCC_AHB4RSTR_CRCRST_Msk        (0x1UL << RCC_AHB4RSTR_CRCRST_Pos)      /*!< 0x00080000 */
#define RCC_AHB4RSTR_CRCRST            RCC_AHB4RSTR_CRCRST_Msk

/********************  Bit definition for RCC_AHB5RSTR register  **************/
#define RCC_AHB5RSTR_HPDMA1RST_Pos     (0U)
#define RCC_AHB5RSTR_HPDMA1RST_Msk     (0x1UL << RCC_AHB5RSTR_HPDMA1RST_Pos)   /*!< 0x00000001 */
#define RCC_AHB5RSTR_HPDMA1RST         RCC_AHB5RSTR_HPDMA1RST_Msk
#define RCC_AHB5RSTR_DMA2DRST_Pos      (1U)
#define RCC_AHB5RSTR_DMA2DRST_Msk      (0x1UL << RCC_AHB5RSTR_DMA2DRST_Pos)    /*!< 0x00000002 */
#define RCC_AHB5RSTR_DMA2DRST          RCC_AHB5RSTR_DMA2DRST_Msk
#define RCC_AHB5RSTR_JPEGRST_Pos       (3U)
#define RCC_AHB5RSTR_JPEGRST_Msk       (0x1UL << RCC_AHB5RSTR_JPEGRST_Pos)     /*!< 0x00000008 */
#define RCC_AHB5RSTR_JPEGRST           RCC_AHB5RSTR_JPEGRST_Msk
#define RCC_AHB5RSTR_FMCRST_Pos        (4U)
#define RCC_AHB5RSTR_FMCRST_Msk        (0x1UL << RCC_AHB5RSTR_FMCRST_Pos)      /*!< 0x00000010 */
#define RCC_AHB5RSTR_FMCRST            RCC_AHB5RSTR_FMCRST_Msk
#define RCC_AHB5RSTR_XSPI1RST_Pos      (5U)
#define RCC_AHB5RSTR_XSPI1RST_Msk      (0x1UL << RCC_AHB5RSTR_XSPI1RST_Pos)    /*!< 0x00000020 */
#define RCC_AHB5RSTR_XSPI1RST          RCC_AHB5RSTR_XSPI1RST_Msk
#define RCC_AHB5RSTR_SDMMC1RST_Pos     (8U)
#define RCC_AHB5RSTR_SDMMC1RST_Msk     (0x1UL << RCC_AHB5RSTR_SDMMC1RST_Pos)   /*!< 0x00000100 */
#define RCC_AHB5RSTR_SDMMC1RST         RCC_AHB5RSTR_SDMMC1RST_Msk
#define RCC_AHB5RSTR_XSPI2RST_Pos      (12U)
#define RCC_AHB5RSTR_XSPI2RST_Msk      (0x1UL << RCC_AHB5RSTR_XSPI2RST_Pos)    /*!< 0x00001000 */
#define RCC_AHB5RSTR_XSPI2RST          RCC_AHB5RSTR_XSPI2RST_Msk
#define RCC_AHB5RSTR_XSPIMRST_Pos      (14U)
#define RCC_AHB5RSTR_XSPIMRST_Msk      (0x1UL << RCC_AHB5RSTR_XSPIMRST_Pos)    /*!< 0x00004000 */
#define RCC_AHB5RSTR_XSPIMRST          RCC_AHB5RSTR_XSPIMRST_Msk
#define RCC_AHB5RSTR_GFXMMURST_Pos     (19U)
#define RCC_AHB5RSTR_GFXMMURST_Msk     (0x1UL << RCC_AHB5RSTR_GFXMMURST_Pos)   /*!< 0x00080000 */
#define RCC_AHB5RSTR_GFXMMURST         RCC_AHB5RSTR_GFXMMURST_Msk

/********************  Bit definition for RCC_APB1RSTR1 register  *************/
#define RCC_APB1RSTR1_TIM2RST_Pos      (0U)
#define RCC_APB1RSTR1_TIM2RST_Msk      (0x1UL << RCC_APB1RSTR1_TIM2RST_Pos)    /*!< 0x00000001 */
#define RCC_APB1RSTR1_TIM2RST          RCC_APB1RSTR1_TIM2RST_Msk
#define RCC_APB1RSTR1_TIM3RST_Pos      (1U)
#define RCC_APB1RSTR1_TIM3RST_Msk      (0x1UL << RCC_APB1RSTR1_TIM3RST_Pos)    /*!< 0x00000002 */
#define RCC_APB1RSTR1_TIM3RST          RCC_APB1RSTR1_TIM3RST_Msk
#define RCC_APB1RSTR1_TIM4RST_Pos      (2U)
#define RCC_APB1RSTR1_TIM4RST_Msk      (0x1UL << RCC_APB1RSTR1_TIM4RST_Pos)    /*!< 0x00000004 */
#define RCC_APB1RSTR1_TIM4RST          RCC_APB1RSTR1_TIM4RST_Msk
#define RCC_APB1RSTR1_TIM5RST_Pos      (3U)
#define RCC_APB1RSTR1_TIM5RST_Msk      (0x1UL << RCC_APB1RSTR1_TIM5RST_Pos)    /*!< 0x00000008 */
#define RCC_APB1RSTR1_TIM5RST          RCC_APB1RSTR1_TIM5RST_Msk
#define RCC_APB1RSTR1_TIM6RST_Pos      (4U)
#define RCC_APB1RSTR1_TIM6RST_Msk      (0x1UL << RCC_APB1RSTR1_TIM6RST_Pos)    /*!< 0x00000010 */
#define RCC_APB1RSTR1_TIM6RST          RCC_APB1RSTR1_TIM6RST_Msk
#define RCC_APB1RSTR1_TIM7RST_Pos      (5U)
#define RCC_APB1RSTR1_TIM7RST_Msk      (0x1UL << RCC_APB1RSTR1_TIM7RST_Pos)    /*!< 0x00000020 */
#define RCC_APB1RSTR1_TIM7RST          RCC_APB1RSTR1_TIM7RST_Msk
#define RCC_APB1RSTR1_TIM12RST_Pos     (6U)
#define RCC_APB1RSTR1_TIM12RST_Msk     (0x1UL << RCC_APB1RSTR1_TIM12RST_Pos)   /*!< 0x00000040 */
#define RCC_APB1RSTR1_TIM12RST         RCC_APB1RSTR1_TIM12RST_Msk
#define RCC_APB1RSTR1_TIM13RST_Pos     (7U)
#define RCC_APB1RSTR1_TIM13RST_Msk     (0x1UL << RCC_APB1RSTR1_TIM13RST_Pos)   /*!< 0x00000080 */
#define RCC_APB1RSTR1_TIM13RST         RCC_APB1RSTR1_TIM13RST_Msk
#define RCC_APB1RSTR1_TIM14RST_Pos     (8U)
#define RCC_APB1RSTR1_TIM14RST_Msk     (0x1UL << RCC_APB1RSTR1_TIM14RST_Pos)   /*!< 0x00000100 */
#define RCC_APB1RSTR1_TIM14RST         RCC_APB1RSTR1_TIM14RST_Msk
#define RCC_APB1RSTR1_LPTIM1RST_Pos    (9U)
#define RCC_APB1RSTR1_LPTIM1RST_Msk    (0x1UL << RCC_APB1RSTR1_LPTIM1RST_Pos)  /*!< 0x00000200 */
#define RCC_APB1RSTR1_LPTIM1RST        RCC_APB1RSTR1_LPTIM1RST_Msk
#define RCC_APB1RSTR1_SPI2RST_Pos      (14U)
#define RCC_APB1RSTR1_SPI2RST_Msk      (0x1UL << RCC_APB1RSTR1_SPI2RST_Pos)    /*!< 0x00004000 */
#define RCC_APB1RSTR1_SPI2RST          RCC_APB1RSTR1_SPI2RST_Msk
#define RCC_APB1RSTR1_SPI3RST_Pos      (15U)
#define RCC_APB1RSTR1_SPI3RST_Msk      (0x1UL << RCC_APB1RSTR1_SPI3RST_Pos)    /*!< 0x00008000 */
#define RCC_APB1RSTR1_SPI3RST          RCC_APB1RSTR1_SPI3RST_Msk
#define RCC_APB1RSTR1_SPDIFRXRST_Pos   (16U)
#define RCC_APB1RSTR1_SPDIFRXRST_Msk   (0x1UL << RCC_APB1RSTR1_SPDIFRXRST_Pos) /*!< 0x00010000 */
#define RCC_APB1RSTR1_SPDIFRXRST       RCC_APB1RSTR1_SPDIFRXRST_Msk
#define RCC_APB1RSTR1_USART2RST_Pos    (17U)
#define RCC_APB1RSTR1_USART2RST_Msk    (0x1UL << RCC_APB1RSTR1_USART2RST_Pos)  /*!< 0x00020000 */
#define RCC_APB1RSTR1_USART2RST        RCC_APB1RSTR1_USART2RST_Msk
#define RCC_APB1RSTR1_USART3RST_Pos    (18U)
#define RCC_APB1RSTR1_USART3RST_Msk    (0x1UL << RCC_APB1RSTR1_USART3RST_Pos)  /*!< 0x00040000 */
#define RCC_APB1RSTR1_USART3RST        RCC_APB1RSTR1_USART3RST_Msk
#define RCC_APB1RSTR1_UART4RST_Pos     (19U)
#define RCC_APB1RSTR1_UART4RST_Msk     (0x1UL << RCC_APB1RSTR1_UART4RST_Pos)   /*!< 0x00080000 */
#define RCC_APB1RSTR1_UART4RST         RCC_APB1RSTR1_UART4RST_Msk
#define RCC_APB1RSTR1_UART5RST_Pos     (20U)
#define RCC_APB1RSTR1_UART5RST_Msk     (0x1UL << RCC_APB1RSTR1_UART5RST_Pos)   /*!< 0x00100000 */
#define RCC_APB1RSTR1_UART5RST         RCC_APB1RSTR1_UART5RST_Msk
#define RCC_APB1RSTR1_I2C1_I3C1RST_Pos (21U)
#define RCC_APB1RSTR1_I2C1_I3C1RST_Msk (0x1UL << RCC_APB1RSTR1_I2C1_I3C1RST_Pos) /*!< 0x00200000 */
#define RCC_APB1RSTR1_I2C1_I3C1RST     RCC_APB1RSTR1_I2C1_I3C1RST_Msk
#define RCC_APB1RSTR1_I2C2RST_Pos      (22U)
#define RCC_APB1RSTR1_I2C2RST_Msk      (0x1UL << RCC_APB1RSTR1_I2C2RST_Pos)    /*!< 0x00400000 */
#define RCC_APB1RSTR1_I2C2RST          RCC_APB1RSTR1_I2C2RST_Msk
#define RCC_APB1RSTR1_I2C3RST_Pos      (23U)
#define RCC_APB1RSTR1_I2C3RST_Msk      (0x1UL << RCC_APB1RSTR1_I2C3RST_Pos)    /*!< 0x00800000 */
#define RCC_APB1RSTR1_I2C3RST          RCC_APB1RSTR1_I2C3RST_Msk
#define RCC_APB1RSTR1_CECRST_Pos       (27U)
#define RCC_APB1RSTR1_CECRST_Msk       (0x1UL << RCC_APB1RSTR1_CECRST_Pos)     /*!< 0x08000000 */
#define RCC_APB1RSTR1_CECRST           RCC_APB1RSTR1_CECRST_Msk
#define RCC_APB1RSTR1_UART7RST_Pos     (30U)
#define RCC_APB1RSTR1_UART7RST_Msk     (0x1UL << RCC_APB1RSTR1_UART7RST_Pos)   /*!< 0x40000000 */
#define RCC_APB1RSTR1_UART7RST         RCC_APB1RSTR1_UART7RST_Msk
#define RCC_APB1RSTR1_UART8RST_Pos     (31U)
#define RCC_APB1RSTR1_UART8RST_Msk     (0x1UL << RCC_APB1RSTR1_UART8RST_Pos)   /*!< 0x80000000 */
#define RCC_APB1RSTR1_UART8RST         RCC_APB1RSTR1_UART8RST_Msk

/********************  Bit definition for RCC_APB1RSTR2 register  *************/
#define RCC_APB1RSTR2_CRSRST_Pos       (1U)
#define RCC_APB1RSTR2_CRSRST_Msk       (0x1UL << RCC_APB1RSTR2_CRSRST_Pos)     /*!< 0x00000002 */
#define RCC_APB1RSTR2_CRSRST           RCC_APB1RSTR2_CRSRST_Msk
#define RCC_APB1RSTR2_MDIOSRST_Pos     (5U)
#define RCC_APB1RSTR2_MDIOSRST_Msk     (0x1UL << RCC_APB1RSTR2_MDIOSRST_Pos)   /*!< 0x00000020 */
#define RCC_APB1RSTR2_MDIOSRST         RCC_APB1RSTR2_MDIOSRST_Msk
#define RCC_APB1RSTR2_FDCANRST_Pos     (8U)
#define RCC_APB1RSTR2_FDCANRST_Msk     (0x1UL << RCC_APB1RSTR2_FDCANRST_Pos)   /*!< 0x00000100 */
#define RCC_APB1RSTR2_FDCANRST         RCC_APB1RSTR2_FDCANRST_Msk
#define RCC_APB1RSTR2_UCPD1RST_Pos     (27U)
#define RCC_APB1RSTR2_UCPD1RST_Msk     (0x1UL << RCC_APB1RSTR2_UCPD1RST_Pos)   /*!< 0x08000000 */
#define RCC_APB1RSTR2_UCPD1RST         RCC_APB1RSTR2_UCPD1RST_Msk

/********************  Bit definition for RCC_APB2RSTR register  **************/
#define RCC_APB2RSTR_TIM1RST_Pos       (0U)
#define RCC_APB2RSTR_TIM1RST_Msk       (0x1UL << RCC_APB2RSTR_TIM1RST_Pos)     /*!< 0x00000001 */
#define RCC_APB2RSTR_TIM1RST           RCC_APB2RSTR_TIM1RST_Msk
#define RCC_APB2RSTR_USART1RST_Pos     (4U)
#define RCC_APB2RSTR_USART1RST_Msk     (0x1UL << RCC_APB2RSTR_USART1RST_Pos)   /*!< 0x00000010 */
#define RCC_APB2RSTR_USART1RST         RCC_APB2RSTR_USART1RST_Msk
#define RCC_APB2RSTR_SPI1RST_Pos       (12U)
#define RCC_APB2RSTR_SPI1RST_Msk       (0x1UL << RCC_APB2RSTR_SPI1RST_Pos)     /*!< 0x00001000 */
#define RCC_APB2RSTR_SPI1RST           RCC_APB2RSTR_SPI1RST_Msk
#define RCC_APB2RSTR_SPI4RST_Pos       (13U)
#define RCC_APB2RSTR_SPI4RST_Msk       (0x1UL << RCC_APB2RSTR_SPI4RST_Pos)     /*!< 0x00002000 */
#define RCC_APB2RSTR_SPI4RST           RCC_APB2RSTR_SPI4RST_Msk
#define RCC_APB2RSTR_TIM15RST_Pos      (16U)
#define RCC_APB2RSTR_TIM15RST_Msk      (0x1UL << RCC_APB2RSTR_TIM15RST_Pos)    /*!< 0x00010000 */
#define RCC_APB2RSTR_TIM15RST          RCC_APB2RSTR_TIM15RST_Msk
#define RCC_APB2RSTR_TIM16RST_Pos      (17U)
#define RCC_APB2RSTR_TIM16RST_Msk      (0x1UL << RCC_APB2RSTR_TIM16RST_Pos)    /*!< 0x00020000 */
#define RCC_APB2RSTR_TIM16RST          RCC_APB2RSTR_TIM16RST_Msk
#define RCC_APB2RSTR_TIM17RST_Pos      (18U)
#define RCC_APB2RSTR_TIM17RST_Msk      (0x1UL << RCC_APB2RSTR_TIM17RST_Pos)    /*!< 0x00040000 */
#define RCC_APB2RSTR_TIM17RST          RCC_APB2RSTR_TIM17RST_Msk
#define RCC_APB2RSTR_TIM9RST_Pos       (19U)
#define RCC_APB2RSTR_TIM9RST_Msk       (0x1UL << RCC_APB2RSTR_TIM9RST_Pos)     /*!< 0x00080000 */
#define RCC_APB2RSTR_TIM9RST           RCC_APB2RSTR_TIM9RST_Msk
#define RCC_APB2RSTR_SPI5RST_Pos       (20U)
#define RCC_APB2RSTR_SPI5RST_Msk       (0x1UL << RCC_APB2RSTR_SPI5RST_Pos)     /*!< 0x00100000 */
#define RCC_APB2RSTR_SPI5RST           RCC_APB2RSTR_SPI5RST_Msk
#define RCC_APB2RSTR_SAI1RST_Pos       (22U)
#define RCC_APB2RSTR_SAI1RST_Msk       (0x1UL << RCC_APB2RSTR_SAI1RST_Pos)     /*!< 0x00400000 */
#define RCC_APB2RSTR_SAI1RST           RCC_APB2RSTR_SAI1RST_Msk
#define RCC_APB2RSTR_SAI2RST_Pos       (23U)
#define RCC_APB2RSTR_SAI2RST_Msk       (0x1UL << RCC_APB2RSTR_SAI2RST_Pos)     /*!< 0x00800000 */
#define RCC_APB2RSTR_SAI2RST           RCC_APB2RSTR_SAI2RST_Msk

/********************  Bit definition for RCC_APB4RSTR register  **************/
#define RCC_APB4RSTR_SBSRST_Pos        (1U)
#define RCC_APB4RSTR_SBSRST_Msk        (0x1UL << RCC_APB4RSTR_SBSRST_Pos)      /*!< 0x00000002 */
#define RCC_APB4RSTR_SBSRST            RCC_APB4RSTR_SBSRST_Msk
#define RCC_APB4RSTR_LPUART1RST_Pos    (3U)
#define RCC_APB4RSTR_LPUART1RST_Msk    (0x1UL << RCC_APB4RSTR_LPUART1RST_Pos)  /*!< 0x00000008 */
#define RCC_APB4RSTR_LPUART1RST        RCC_APB4RSTR_LPUART1RST_Msk
#define RCC_APB4RSTR_SPI6RST_Pos       (5U)
#define RCC_APB4RSTR_SPI6RST_Msk       (0x1UL << RCC_APB4RSTR_SPI6RST_Pos)     /*!< 0x00000020 */
#define RCC_APB4RSTR_SPI6RST           RCC_APB4RSTR_SPI6RST_Msk
#define RCC_APB4RSTR_LPTIM2RST_Pos     (9U)
#define RCC_APB4RSTR_LPTIM2RST_Msk     (0x1UL << RCC_APB4RSTR_LPTIM2RST_Pos)   /*!< 0x00000200 */
#define RCC_APB4RSTR_LPTIM2RST         RCC_APB4RSTR_LPTIM2RST_Msk
#define RCC_APB4RSTR_LPTIM3RST_Pos     (10U)
#define RCC_APB4RSTR_LPTIM3RST_Msk     (0x1UL << RCC_APB4RSTR_LPTIM3RST_Pos)   /*!< 0x00000400 */
#define RCC_APB4RSTR_LPTIM3RST         RCC_APB4RSTR_LPTIM3RST_Msk
#define RCC_APB4RSTR_LPTIM4RST_Pos     (11U)
#define RCC_APB4RSTR_LPTIM4RST_Msk     (0x1UL << RCC_APB4RSTR_LPTIM4RST_Pos)   /*!< 0x00000800 */
#define RCC_APB4RSTR_LPTIM4RST         RCC_APB4RSTR_LPTIM4RST_Msk
#define RCC_APB4RSTR_LPTIM5RST_Pos     (12U)
#define RCC_APB4RSTR_LPTIM5RST_Msk     (0x1UL << RCC_APB4RSTR_LPTIM5RST_Pos)   /*!< 0x00001000 */
#define RCC_APB4RSTR_LPTIM5RST         RCC_APB4RSTR_LPTIM5RST_Msk
#define RCC_APB4RSTR_VREFRST_Pos       (15U)
#define RCC_APB4RSTR_VREFRST_Msk       (0x1UL << RCC_APB4RSTR_VREFRST_Pos)     /*!< 0x00008000 */
#define RCC_APB4RSTR_VREFRST           RCC_APB4RSTR_VREFRST_Msk
#define RCC_APB4RSTR_DTSRST_Pos        (26U)
#define RCC_APB4RSTR_DTSRST_Msk        (0x1UL << RCC_APB4RSTR_DTSRST_Pos)      /*!< 0x04000000 */
#define RCC_APB4RSTR_DTSRST            RCC_APB4RSTR_DTSRST_Msk

/********************  Bit definition for RCC_APB5RSTR register  **************/
#define RCC_APB5RSTR_DCMIPPRST_Pos     (2U)
#define RCC_APB5RSTR_DCMIPPRST_Msk     (0x1UL << RCC_APB5RSTR_DCMIPPRST_Pos)   /*!< 0x00000004 */
#define RCC_APB5RSTR_DCMIPPRST         RCC_APB5RSTR_DCMIPPRST_Msk
#define RCC_APB5RSTR_GFXTIMRST_Pos     (4U)
#define RCC_APB5RSTR_GFXTIMRST_Msk     (0x1UL << RCC_APB5RSTR_GFXTIMRST_Pos)   /*!< 0x00000010 */
#define RCC_APB5RSTR_GFXTIMRST         RCC_APB5RSTR_GFXTIMRST_Msk

/********************  Bit definition for RCC_CKGDISR register  ***************/
#define RCC_CKGDISR_AXICKG_Pos         (0U)
#define RCC_CKGDISR_AXICKG_Msk         (0x1UL << RCC_CKGDISR_AXICKG_Pos)       /*!< 0x00000001 */
#define RCC_CKGDISR_AXICKG             RCC_CKGDISR_AXICKG_Msk
#define RCC_CKGDISR_AHBMCKG_Pos        (1U)
#define RCC_CKGDISR_AHBMCKG_Msk        (0x1UL << RCC_CKGDISR_AHBMCKG_Pos)      /*!< 0x00000002 */
#define RCC_CKGDISR_AHBMCKG            RCC_CKGDISR_AHBMCKG_Msk
#define RCC_CKGDISR_SDMMC1CKG_Pos      (2U)
#define RCC_CKGDISR_SDMMC1CKG_Msk      (0x1UL << RCC_CKGDISR_SDMMC1CKG_Pos)    /*!< 0x00000004 */
#define RCC_CKGDISR_SDMMC1CKG           RCC_CKGDISR_SDMMC1CKG_Msk
#define RCC_CKGDISR_HPDMA1CKG_Pos      (3U)
#define RCC_CKGDISR_HPDMA1CKG_Msk      (0x1UL << RCC_CKGDISR_HPDMA1CKG_Pos)    /*!< 0x00000008 */
#define RCC_CKGDISR_HPDMA1CKG          RCC_CKGDISR_HPDMA1CKG_Msk
#define RCC_CKGDISR_CPUCKG_Pos         (4U)
#define RCC_CKGDISR_CPUCKG_Msk         (0x1UL << RCC_CKGDISR_CPUCKG_Pos)       /*!< 0x00000010 */
#define RCC_CKGDISR_CPUCKG             RCC_CKGDISR_CPUCKG_Msk
#define RCC_CKGDISR_DCMIPPCKG_Pos      (8U)
#define RCC_CKGDISR_DCMIPPCKG_Msk      (0x1UL << RCC_CKGDISR_DCMIPPCKG_Pos)    /*!< 0x00000100 */
#define RCC_CKGDISR_DCMIPPCKG          RCC_CKGDISR_DCMIPPCKG_Msk
#define RCC_CKGDISR_DMA2DCKG_Pos       (9U)
#define RCC_CKGDISR_DMA2DCKG_Msk       (0x1UL << RCC_CKGDISR_DMA2DCKG_Pos)     /*!< 0x00000200 */
#define RCC_CKGDISR_DMA2DCKG           RCC_CKGDISR_DMA2DCKG_Msk
#define RCC_CKGDISR_GFXMMUSCKG_Pos     (10U)
#define RCC_CKGDISR_GFXMMUSCKG_Msk     (0x1UL << RCC_CKGDISR_GFXMMUSCKG_Pos)   /*!< 0x00000400 */
#define RCC_CKGDISR_GFXMMUSCKG         RCC_CKGDISR_GFXMMUSCKG_Msk
#define RCC_CKGDISR_GFXMMUMCKG_Pos     (12U)
#define RCC_CKGDISR_GFXMMUMCKG_Msk     (0x1UL << RCC_CKGDISR_GFXMMUMCKG_Pos)   /*!< 0x00001000 */
#define RCC_CKGDISR_GFXMMUMCKG         RCC_CKGDISR_GFXMMUMCKG_Msk
#define RCC_CKGDISR_AHBSCKG_Pos        (13U)
#define RCC_CKGDISR_AHBSCKG_Msk        (0x1UL << RCC_CKGDISR_AHBSCKG_Pos)      /*!< 0x00002000 */
#define RCC_CKGDISR_AHBSCKG            RCC_CKGDISR_AHBSCKG_Msk
#define RCC_CKGDISR_FMCCKG_Pos         (14U)
#define RCC_CKGDISR_FMCCKG_Msk         (0x1UL << RCC_CKGDISR_FMCCKG_Pos)       /*!< 0x00004000 */
#define RCC_CKGDISR_FMCCKG             RCC_CKGDISR_FMCCKG_Msk
#define RCC_CKGDISR_XSPI1CKG_Pos       (15U)
#define RCC_CKGDISR_XSPI1CKG_Msk       (0x1UL << RCC_CKGDISR_XSPI1CKG_Pos)     /*!< 0x00008000 */
#define RCC_CKGDISR_XSPI1CKG           RCC_CKGDISR_XSPI1CKG_Msk
#define RCC_CKGDISR_XSPI2CKG_Pos       (16U)
#define RCC_CKGDISR_XSPI2CKG_Msk       (0x1UL << RCC_CKGDISR_XSPI2CKG_Pos)     /*!< 0x00010000 */
#define RCC_CKGDISR_XSPI2CKG           RCC_CKGDISR_XSPI2CKG_Msk
#define RCC_CKGDISR_AXISRAM4CKG_Pos    (17U)
#define RCC_CKGDISR_AXISRAM4CKG_Msk    (0x1UL << RCC_CKGDISR_AXISRAM4CKG_Pos)  /*!< 0x00020000 */
#define RCC_CKGDISR_AXISRAM4CKG        RCC_CKGDISR_AXISRAM4CKG_Msk
#define RCC_CKGDISR_AXISRAM3CKG_Pos    (18U)
#define RCC_CKGDISR_AXISRAM3CKG_Msk    (0x1UL << RCC_CKGDISR_AXISRAM3CKG_Pos)  /*!< 0x00040000 */
#define RCC_CKGDISR_AXISRAM3CKG        RCC_CKGDISR_AXISRAM3CKG_Msk
#define RCC_CKGDISR_AXISRAM2CKG_Pos    (19U)
#define RCC_CKGDISR_AXISRAM2CKG_Msk    (0x1UL << RCC_CKGDISR_AXISRAM2CKG_Pos)  /*!< 0x00080000 */
#define RCC_CKGDISR_AXISRAM2CKG        RCC_CKGDISR_AXISRAM2CKG_Msk
#define RCC_CKGDISR_AXISRAM1CKG_Pos    (20U)
#define RCC_CKGDISR_AXISRAM1CKG_Msk    (0x1UL << RCC_CKGDISR_AXISRAM1CKG_Pos)  /*!< 0x00100000 */
#define RCC_CKGDISR_AXISRAM1CKG        RCC_CKGDISR_AXISRAM1CKG_Msk
#define RCC_CKGDISR_FLASHCKG_Pos       (21U)
#define RCC_CKGDISR_FLASHCKG_Msk       (0x1UL << RCC_CKGDISR_FLASHCKG_Pos)     /*!< 0x00200000 */
#define RCC_CKGDISR_FLASHCKG           RCC_CKGDISR_FLASHCKG_Msk
#define RCC_CKGDISR_EXTICKG_Pos        (30U)
#define RCC_CKGDISR_EXTICKG_Msk        (0x1UL << RCC_CKGDISR_EXTICKG_Pos)      /*!< 0x40000000 */
#define RCC_CKGDISR_EXTICKG            RCC_CKGDISR_EXTICKG_Msk
#define RCC_CKGDISR_JTAGCKG_Pos        (31U)
#define RCC_CKGDISR_JTAGCKG_Msk        (0x1UL << RCC_CKGDISR_JTAGCKG_Pos)      /*!< 0x80000000 */
#define RCC_CKGDISR_JTAGCKG            RCC_CKGDISR_JTAGCKG_Msk

