RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7s3xx.h
/*******************  Bits definition for SAES_KEYR1 register  ******************/
#define SAES_KEYR1_Pos                       (0U)
#define SAES_KEYR1_Msk                       (0xFFFFFFFFUL << SAES_KEYR1_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR1                           SAES_KEYR1_Msk                           /*!< SAES Key Register 1 */

/*******************  Bits definition for SAES_KEYR2 register  ******************/
#define SAES_KEYR2_Pos                       (0U)
#define SAES_KEYR2_Msk                       (0xFFFFFFFFUL << SAES_KEYR2_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR2                           SAES_KEYR2_Msk                           /*!< SAES Key Register 2 */

/*******************  Bits definition for SAES_KEYR3 register  ******************/
#define SAES_KEYR3_Pos                       (0U)
#define SAES_KEYR3_Msk                       (0xFFFFFFFFUL << SAES_KEYR3_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR3                           SAES_KEYR3_Msk                           /*!< SAES Key Register 3 */

/*******************  Bits definition for SAES_KEYR4 register  ******************/
#define SAES_KEYR4_Pos                       (0U)
#define SAES_KEYR4_Msk                       (0xFFFFFFFFUL << SAES_KEYR4_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR4                           SAES_KEYR4_Msk                           /*!< SAES Key Register 4 */

/*******************  Bits definition for SAES_KEYR5 register  ******************/
#define SAES_KEYR5_Pos                       (0U)
#define SAES_KEYR5_Msk                       (0xFFFFFFFFUL << SAES_KEYR5_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR5                           SAES_KEYR5_Msk                           /*!< SAES Key Register 5 */

/*******************  Bits definition for SAES_KEYR6 register  ******************/
#define SAES_KEYR6_Pos                       (0U)
#define SAES_KEYR6_Msk                       (0xFFFFFFFFUL << SAES_KEYR6_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR6                           SAES_KEYR6_Msk                           /*!< SAES Key Register 6 */

/*******************  Bits definition for SAES_KEYR7 register  ******************/
#define SAES_KEYR7_Pos                       (0U)
#define SAES_KEYR7_Msk                       (0xFFFFFFFFUL << SAES_KEYR7_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR7                           SAES_KEYR7_Msk                           /*!< SAES Key Register 7 */

/*******************  Bits definition for SAES_IVR0 register   ******************/
#define SAES_IVR0_Pos                        (0U)
#define SAES_IVR0_Msk                        (0xFFFFFFFFUL << SAES_IVR0_Pos)          /*!< 0xFFFFFFFF */
#define SAES_IVR0                            SAES_IVR0_Msk                            /*!< SAES Initialization Vector Register 0 */

/*******************  Bits definition for SAES_IVR1 register   ******************/
#define SAES_IVR1_Pos                        (0U)
#define SAES_IVR1_Msk                        (0xFFFFFFFFUL << SAES_IVR1_Pos)          /*!< 0xFFFFFFFF */
#define SAES_IVR1                            SAES_IVR1_Msk                            /*!< SAES Initialization Vector Register 1 */

/*******************  Bits definition for SAES_IVR2 register   ******************/
#define SAES_IVR2_Pos                        (0U)
#define SAES_IVR2_Msk                        (0xFFFFFFFFUL << SAES_IVR2_Pos)          /*!< 0xFFFFFFFF */
#define SAES_IVR2                            SAES_IVR2_Msk                            /*!< SAES Initialization Vector Register 2 */

/*******************  Bits definition for SAES_IVR3 register   ******************/
#define SAES_IVR3_Pos                        (0U)
#define SAES_IVR3_Msk                        (0xFFFFFFFFUL << SAES_IVR3_Pos)          /*!< 0xFFFFFFFF */
#define SAES_IVR3                            SAES_IVR3_Msk                            /*!< SAES Initialization Vector Register 3 */

/*******************  Bit definition for SAES_SUSP0R register  ******************/
#define SAES_SUSP0R_Pos                      (0U)
#define SAES_SUSP0R_Msk                      (0xFFFFFFFFUL << SAES_SUSP0R_Pos)        /*!< 0xFFFFFFFF */
#define SAES_SUSP0R                          SAES_SUSP0R_Msk                          /*!< SAES Suspend registers 0 */

/*******************  Bit definition for SAES_SUSP1R register  ******************/
#define SAES_SUSP1R_Pos                      (0U)
#define SAES_SUSP1R_Msk                      (0xFFFFFFFFUL << SAES_SUSP1R_Pos)        /*!< 0xFFFFFFFF */
#define SAES_SUSP1R                          SAES_SUSP1R_Msk                          /*!< SAES Suspend registers 1 */

/*******************  Bit definition for SAES_SUSP2R register  ******************/
#define SAES_SUSP2R_Pos                      (0U)
#define SAES_SUSP2R_Msk                      (0xFFFFFFFFUL << SAES_SUSP2R_Pos)        /*!< 0xFFFFFFFF */
#define SAES_SUSP2R                          SAES_SUSP2R_Msk                          /*!< SAES Suspend registers 2 */

/*******************  Bit definition for SAES_SUSP3R register  ******************/
#define SAES_SUSP3R_Pos                      (0U)
#define SAES_SUSP3R_Msk                      (0xFFFFFFFFUL << SAES_SUSP3R_Pos)        /*!< 0xFFFFFFFF */
#define SAES_SUSP3R                          SAES_SUSP3R_Msk                          /*!< SAES Suspend registers 3 */

/*******************  Bit definition for SAES_SUSP4R register  ******************/
#define SAES_SUSP4R_Pos                      (0U)
#define SAES_SUSP4R_Msk                      (0xFFFFFFFFUL << SAES_SUSP4R_Pos)        /*!< 0xFFFFFFFF */
#define SAES_SUSP4R                          SAES_SUSP4R_Msk                          /*!< SAES Suspend registers 4 */

/*******************  Bit definition for SAES_SUSP5R register  ******************/
#define SAES_SUSP5R_Pos                      (0U)
#define SAES_SUSP5R_Msk                      (0xFFFFFFFFUL << SAES_SUSP5R_Pos)        /*!< 0xFFFFFFFF */
#define SAES_SUSP5R                          SAES_SUSP5R_Msk                          /*!< AES Suspend registers 5 */

/*******************  Bit definition for SAES_SUSP6R register  ******************/
#define SAES_SUSP6R_Pos                      (0U)
#define SAES_SUSP6R_Msk                      (0xFFFFFFFFUL << SAES_SUSP6R_Pos)        /*!< 0xFFFFFFFF */
#define SAES_SUSP6R                          SAES_SUSP6R_Msk                          /*!< SAES Suspend registers 6 */

