RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7s3xx.h
/****************  Bit definition for SBS_CCSWVALR register  *******************/
#define SBS_CCSWVALR_SW_NSRC_Pos         (0U)
#define SBS_CCSWVALR_SW_NSRC_Msk         (0xFUL << SBS_CCSWVALR_SW_NSRC_Pos)         /*!< 0x0000000F */
#define SBS_CCSWVALR_SW_NSRC             SBS_CCSWVALR_SW_NSRC_Msk                    /*!< Software NMOS transistors slew-rate compensation */
#define SBS_CCSWVALR_SW_PSRC_Pos         (4U)
#define SBS_CCSWVALR_SW_PSRC_Msk         (0xFUL << SBS_CCSWVALR_SW_PSRC_Pos)         /*!< 0x000000F0 */
#define SBS_CCSWVALR_SW_PSRC             SBS_CCSWVALR_SW_PSRC_Msk                    /*!< Software PMOS transistors slew-rate compensation */
#define SBS_CCSWVALR_XSPI1_SW_NSRC_Pos   (8U)
#define SBS_CCSWVALR_XSPI1_SW_NSRC_Msk   (0xFUL << SBS_CCSWVALR_XSPI1_SW_NSRC_Pos)   /*!< 0x00000F00 */
#define SBS_CCSWVALR_XSPI1_SW_NSRC       SBS_CCSWVALR_XSPI1_SW_NSRC_Msk              /*!< XSPIM_P1 software NMOS transistors slew-rate compensation */
#define SBS_CCSWVALR_XSPI1_SW_PSRC_Pos   (12U)
#define SBS_CCSWVALR_XSPI1_SW_PSRC_Msk   (0xFUL << SBS_CCSWVALR_XSPI1_SW_PSRC_Pos)   /*!< 0x0000F000 */
#define SBS_CCSWVALR_XSPI1_SW_PSRC       SBS_CCSWVALR_XSPI1_SW_PSRC_Msk              /*!< XSPIM_P1 software PMOS transistors slew-rate compensation */
#define SBS_CCSWVALR_XSPI2_SW_NSRC_Pos   (16U)
#define SBS_CCSWVALR_XSPI2_SW_NSRC_Msk   (0xFUL << SBS_CCSWVALR_XSPI2_SW_NSRC_Pos)   /*!< 0x000F0000 */
#define SBS_CCSWVALR_XSPI2_SW_NSRC       SBS_CCSWVALR_XSPI2_SW_NSRC_Msk              /*!< XSPIM_P2 software NMOS transistors slew-rate compensation */
#define SBS_CCSWVALR_XSPI2_SW_PSRC_Pos   (20U)
#define SBS_CCSWVALR_XSPI2_SW_PSRC_Msk   (0xFUL << SBS_CCSWVALR_XSPI2_SW_PSRC_Pos)   /*!< 0x00F00000 */
#define SBS_CCSWVALR_XSPI2_SW_PSRC       SBS_CCSWVALR_XSPI2_SW_PSRC_Msk              /*!< XSPIM_P2 software PMOS transistors slew-rate compensation */

/********************  Bit definition for SBS_BKLOCKR register  ****************/
#define SBS_BKLOCKR_PVD_BL_Pos           (2U)
#define SBS_BKLOCKR_PVD_BL_Msk           (0x1UL << SBS_BKLOCKR_PVD_BL_Pos)           /*!< 0x00000004 */
#define SBS_BKLOCKR_PVD_BL               SBS_BKLOCKR_PVD_BL_Msk                      /*!< PVD break lock */
#define SBS_BKLOCKR_FLASHECC_BL_Pos      (3U)
#define SBS_BKLOCKR_FLASHECC_BL_Msk      (0x1UL << SBS_BKLOCKR_FLASHECC_BL_Pos)      /*!< 0x00000008 */
#define SBS_BKLOCKR_FLASHECC_BL          SBS_BKLOCKR_FLASHECC_BL_Msk                 /*!< Flash ECC error break lock */
#define SBS_BKLOCKR_CM7LCKUP_BL_Pos      (6U)
#define SBS_BKLOCKR_CM7LCKUP_BL_Msk      (0x1UL << SBS_BKLOCKR_CM7LCKUP_BL_Pos)      /*!< 0x00000040 */
#define SBS_BKLOCKR_CM7LCKUP_BL          SBS_BKLOCKR_CM7LCKUP_BL_Msk                 /*!< Cortex-M7 lockup break lock */
#define SBS_BKLOCKR_BKRAMECC_BL_Pos      (7U)
#define SBS_BKLOCKR_BKRAMECC_BL_Msk      (0x1UL << SBS_BKLOCKR_BKRAMECC_BL_Pos)      /*!< 0x00000080 */
#define SBS_BKLOCKR_BKRAMECC_BL          SBS_BKLOCKR_BKRAMECC_BL_Msk                 /*!< Backup RAM ECC error break lock */
#define SBS_BKLOCKR_DTCMECC_BL_Pos       (13U)
#define SBS_BKLOCKR_DTCMECC_BL_Msk       (0x1UL << SBS_BKLOCKR_DTCMECC_BL_Pos)       /*!< 0x00002000 */
#define SBS_BKLOCKR_DTCMECC_BL           SBS_BKLOCKR_DTCMECC_BL_Msk                  /*!< DTCM ECC error break lock */
#define SBS_BKLOCKR_ITCMECC_BL_Pos       (14U)
#define SBS_BKLOCKR_ITCMECC_BL_Msk       (0x1UL << SBS_BKLOCKR_ITCMECC_BL_Pos)       /*!< 0x00004000 */
#define SBS_BKLOCKR_ITCMECC_BL           SBS_BKLOCKR_ITCMECC_BL_Msk                  /*!< ITCM ECC error break lock */
#define SBS_BKLOCKR_ARAM3ECC_BL_Pos      (21U)
#define SBS_BKLOCKR_ARAM3ECC_BL_Msk      (0x1UL << SBS_BKLOCKR_ARAM3ECC_BL_Pos)      /*!< 0x00200000 */
#define SBS_BKLOCKR_ARAM3ECC_BL          SBS_BKLOCKR_ARAM3ECC_BL_Msk                 /*!< AXIRAM3 ECC error break lock */
#define SBS_BKLOCKR_ARAM1ECC_BL_Pos      (23U)
#define SBS_BKLOCKR_ARAM1ECC_BL_Msk      (0x1UL << SBS_BKLOCKR_ARAM1ECC_BL_Pos)      /*!< 0x00800000 */
#define SBS_BKLOCKR_ARAM1ECC_BL          SBS_BKLOCKR_ARAM1ECC_BL_Msk                 /*!< AXIRAM1 ECC error break lock */

/*****************  Bit definition for SBS_EXTICR1 register  ******************/
#define SBS_EXTICR1_PC_EXTI0_Pos         (0U)
#define SBS_EXTICR1_PC_EXTI0_Msk         (0xFUL << SBS_EXTICR1_PC_EXTI0_Pos)         /*!< 0x0000000F */
#define SBS_EXTICR1_PC_EXTI0             SBS_EXTICR1_PC_EXTI0_Msk                    /*!< Port configuration EXTI 0 */
#define SBS_EXTICR1_PC_EXTI0_0           (0x1UL << SBS_EXTICR1_PC_EXTI0_Pos)         /*!< 0x00000001 */
#define SBS_EXTICR1_PC_EXTI0_1           (0x2UL << SBS_EXTICR1_PC_EXTI0_Pos)         /*!< 0x00000002 */
#define SBS_EXTICR1_PC_EXTI0_2           (0x4UL << SBS_EXTICR1_PC_EXTI0_Pos)         /*!< 0x00000004 */
#define SBS_EXTICR1_PC_EXTI0_3           (0x8UL << SBS_EXTICR1_PC_EXTI0_Pos)         /*!< 0x00000008 */
#define SBS_EXTICR1_PC_EXTI1_Pos         (4U)
#define SBS_EXTICR1_PC_EXTI1_Msk         (0xFUL << SBS_EXTICR1_PC_EXTI1_Pos)         /*!< 0x000000F0 */
#define SBS_EXTICR1_PC_EXTI1             SBS_EXTICR1_PC_EXTI1_Msk                    /*!< Port configuration EXTI 1 */
#define SBS_EXTICR1_PC_EXTI1_0           (0x1UL << SBS_EXTICR1_PC_EXTI1_Pos)         /*!< 0x00000010 */
#define SBS_EXTICR1_PC_EXTI1_1           (0x2UL << SBS_EXTICR1_PC_EXTI1_Pos)         /*!< 0x00000020 */
#define SBS_EXTICR1_PC_EXTI1_2           (0x4UL << SBS_EXTICR1_PC_EXTI1_Pos)         /*!< 0x00000040 */
#define SBS_EXTICR1_PC_EXTI1_3           (0x8UL << SBS_EXTICR1_PC_EXTI1_Pos)         /*!< 0x00000080 */
#define SBS_EXTICR1_PC_EXTI2_Pos         (8U)
#define SBS_EXTICR1_PC_EXTI2_Msk         (0xFUL << SBS_EXTICR1_PC_EXTI2_Pos)         /*!< 0x00000F00 */
#define SBS_EXTICR1_PC_EXTI2             SBS_EXTICR1_PC_EXTI2_Msk                    /*!< Port configuration EXTI 2 */
#define SBS_EXTICR1_PC_EXTI2_0           (0x1UL << SBS_EXTICR1_PC_EXTI2_Pos)         /*!< 0x00000100 */
#define SBS_EXTICR1_PC_EXTI2_1           (0x2UL << SBS_EXTICR1_PC_EXTI2_Pos)         /*!< 0x00000200 */
#define SBS_EXTICR1_PC_EXTI2_2           (0x4UL << SBS_EXTICR1_PC_EXTI2_Pos)         /*!< 0x00000400 */
#define SBS_EXTICR1_PC_EXTI2_3           (0x8UL << SBS_EXTICR1_PC_EXTI2_Pos)         /*!< 0x00000800 */
#define SBS_EXTICR1_PC_EXTI3_Pos         (12U)
#define SBS_EXTICR1_PC_EXTI3_Msk         (0xFUL << SBS_EXTICR1_PC_EXTI3_Pos)         /*!< 0x0000F000 */
#define SBS_EXTICR1_PC_EXTI3             SBS_EXTICR1_PC_EXTI3_Msk                    /*!< Port configuration EXTI 3 */
#define SBS_EXTICR1_PC_EXTI3_0           (0x1UL << SBS_EXTICR1_PC_EXTI3_Pos)         /*!< 0x00001000 */
#define SBS_EXTICR1_PC_EXTI3_1           (0x2UL << SBS_EXTICR1_PC_EXTI3_Pos)         /*!< 0x00002000 */
#define SBS_EXTICR1_PC_EXTI3_2           (0x4UL << SBS_EXTICR1_PC_EXTI3_Pos)         /*!< 0x00004000 */
#define SBS_EXTICR1_PC_EXTI3_3           (0x8UL << SBS_EXTICR1_PC_EXTI3_Pos)         /*!< 0x00008000 */

/*****************  Bit definition for SBS_EXTICR2 register  ******************/
#define SBS_EXTICR2_PC_EXTI4_Pos         (0U)
#define SBS_EXTICR2_PC_EXTI4_Msk         (0xFUL << SBS_EXTICR2_PC_EXTI4_Pos)         /*!< 0x0000000F */
#define SBS_EXTICR2_PC_EXTI4             SBS_EXTICR2_PC_EXTI4_Msk                    /*!< Port configuration EXTI 4 */
#define SBS_EXTICR2_PC_EXTI4_0           (0x1UL << SBS_EXTICR2_PC_EXTI4_Pos)         /*!< 0x00000001 */
#define SBS_EXTICR2_PC_EXTI4_1           (0x2UL << SBS_EXTICR2_PC_EXTI4_Pos)         /*!< 0x00000002 */
#define SBS_EXTICR2_PC_EXTI4_2           (0x4UL << SBS_EXTICR2_PC_EXTI4_Pos)         /*!< 0x00000004 */
#define SBS_EXTICR2_PC_EXTI4_3           (0x8UL << SBS_EXTICR2_PC_EXTI4_Pos)         /*!< 0x00000008 */
#define SBS_EXTICR2_PC_EXTI5_Pos         (4U)
#define SBS_EXTICR2_PC_EXTI5_Msk         (0xFUL << SBS_EXTICR2_PC_EXTI5_Pos)         /*!< 0x000000F0 */
#define SBS_EXTICR2_PC_EXTI5             SBS_EXTICR2_PC_EXTI5_Msk                    /*!< Port configuration EXTI 5 */
#define SBS_EXTICR2_PC_EXTI5_0           (0x1UL << SBS_EXTICR2_PC_EXTI5_Pos)         /*!< 0x00000010 */
#define SBS_EXTICR2_PC_EXTI5_1           (0x2UL << SBS_EXTICR2_PC_EXTI5_Pos)         /*!< 0x00000020 */
#define SBS_EXTICR2_PC_EXTI5_2           (0x4UL << SBS_EXTICR2_PC_EXTI5_Pos)         /*!< 0x00000040 */
#define SBS_EXTICR2_PC_EXTI5_3           (0x8UL << SBS_EXTICR2_PC_EXTI5_Pos)         /*!< 0x00000080 */
#define SBS_EXTICR2_PC_EXTI6_Pos         (8U)
#define SBS_EXTICR2_PC_EXTI6_Msk         (0xFUL << SBS_EXTICR2_PC_EXTI6_Pos)         /*!< 0x00000F00 */
#define SBS_EXTICR2_PC_EXTI6             SBS_EXTICR2_PC_EXTI6_Msk                    /*!< Port configuration EXTI 6 */
#define SBS_EXTICR2_PC_EXTI6_0           (0x1UL << SBS_EXTICR2_PC_EXTI6_Pos)         /*!< 0x00000100 */
#define SBS_EXTICR2_PC_EXTI6_1           (0x2UL << SBS_EXTICR2_PC_EXTI6_Pos)         /*!< 0x00000200 */
#define SBS_EXTICR2_PC_EXTI6_2           (0x4UL << SBS_EXTICR2_PC_EXTI6_Pos)         /*!< 0x00000400 */
#define SBS_EXTICR2_PC_EXTI6_3           (0x8UL << SBS_EXTICR2_PC_EXTI6_Pos)         /*!< 0x00000800 */
#define SBS_EXTICR2_PC_EXTI7_Pos         (12U)
#define SBS_EXTICR2_PC_EXTI7_Msk         (0xFUL << SBS_EXTICR2_PC_EXTI7_Pos)         /*!< 0x0000F000 */
#define SBS_EXTICR2_PC_EXTI7             SBS_EXTICR2_PC_EXTI7_Msk                    /*!< Port configuration EXTI 7 */
#define SBS_EXTICR2_PC_EXTI7_0           (0x1UL << SBS_EXTICR2_PC_EXTI7_Pos)         /*!< 0x00001000 */
#define SBS_EXTICR2_PC_EXTI7_1           (0x2UL << SBS_EXTICR2_PC_EXTI7_Pos)         /*!< 0x00002000 */
#define SBS_EXTICR2_PC_EXTI7_2           (0x4UL << SBS_EXTICR2_PC_EXTI7_Pos)         /*!< 0x00004000 */
#define SBS_EXTICR2_PC_EXTI7_3           (0x8UL << SBS_EXTICR2_PC_EXTI7_Pos)         /*!< 0x00008000 */

/*****************  Bit definition for SBS_EXTICR3 register  ******************/
#define SBS_EXTICR3_PC_EXTI8_Pos         (0U)
#define SBS_EXTICR3_PC_EXTI8_Msk         (0xFUL << SBS_EXTICR3_PC_EXTI8_Pos)         /*!< 0x0000000F */
#define SBS_EXTICR3_PC_EXTI8             SBS_EXTICR3_PC_EXTI8_Msk                    /*!< Port configuration EXTI 8 */
#define SBS_EXTICR3_PC_EXTI8_0           (0x1UL << SBS_EXTICR3_PC_EXTI8_Pos)         /*!< 0x00000001 */
#define SBS_EXTICR3_PC_EXTI8_1           (0x2UL << SBS_EXTICR3_PC_EXTI8_Pos)         /*!< 0x00000002 */
#define SBS_EXTICR3_PC_EXTI8_2           (0x4UL << SBS_EXTICR3_PC_EXTI8_Pos)         /*!< 0x00000004 */
#define SBS_EXTICR3_PC_EXTI8_3           (0x8UL << SBS_EXTICR3_PC_EXTI8_Pos)         /*!< 0x00000008 */
#define SBS_EXTICR3_PC_EXTI9_Pos         (4U)
#define SBS_EXTICR3_PC_EXTI9_Msk         (0xFUL << SBS_EXTICR3_PC_EXTI9_Pos)         /*!< 0x000000F0 */
#define SBS_EXTICR3_PC_EXTI9             SBS_EXTICR3_PC_EXTI9_Msk                    /*!< Port configuration EXTI 9 */
#define SBS_EXTICR3_PC_EXTI9_0           (0x1UL << SBS_EXTICR3_PC_EXTI9_Pos)         /*!< 0x00000010 */
#define SBS_EXTICR3_PC_EXTI9_1           (0x2UL << SBS_EXTICR3_PC_EXTI9_Pos)         /*!< 0x00000020 */
#define SBS_EXTICR3_PC_EXTI9_2           (0x4UL << SBS_EXTICR3_PC_EXTI9_Pos)         /*!< 0x00000040 */
#define SBS_EXTICR3_PC_EXTI9_3           (0x8UL << SBS_EXTICR3_PC_EXTI9_Pos)         /*!< 0x00000080 */
#define SBS_EXTICR3_PC_EXTI10_Pos        (8U)
#define SBS_EXTICR3_PC_EXTI10_Msk        (0xFUL << SBS_EXTICR3_PC_EXTI10_Pos)        /*!< 0x00000F00 */
#define SBS_EXTICR3_PC_EXTI10            SBS_EXTICR3_PC_EXTI10_Msk                   /*!< Port configuration EXTI 10 */
#define SBS_EXTICR3_PC_EXTI10_0          (0x1UL << SBS_EXTICR3_PC_EXTI10_Pos)        /*!< 0x00000100 */
#define SBS_EXTICR3_PC_EXTI10_1          (0x2UL << SBS_EXTICR3_PC_EXTI10_Pos)        /*!< 0x00000200 */
#define SBS_EXTICR3_PC_EXTI10_2          (0x4UL << SBS_EXTICR3_PC_EXTI10_Pos)        /*!< 0x00000400 */
#define SBS_EXTICR3_PC_EXTI10_3          (0x8UL << SBS_EXTICR3_PC_EXTI10_Pos)        /*!< 0x00000800 */
#define SBS_EXTICR3_PC_EXTI11_Pos        (12U)
#define SBS_EXTICR3_PC_EXTI11_Msk        (0xFUL << SBS_EXTICR3_PC_EXTI11_Pos)        /*!< 0x0000F000 */
#define SBS_EXTICR3_PC_EXTI11            SBS_EXTICR3_PC_EXTI11_Msk                   /*!< Port configuration EXTI 11 */
#define SBS_EXTICR3_PC_EXTI11_0          (0x1UL << SBS_EXTICR3_PC_EXTI11_Pos)        /*!< 0x00001000 */
#define SBS_EXTICR3_PC_EXTI11_1          (0x2UL << SBS_EXTICR3_PC_EXTI11_Pos)        /*!< 0x00002000 */
#define SBS_EXTICR3_PC_EXTI11_2          (0x4UL << SBS_EXTICR3_PC_EXTI11_Pos)        /*!< 0x00004000 */
#define SBS_EXTICR3_PC_EXTI11_3          (0x8UL << SBS_EXTICR3_PC_EXTI11_Pos)        /*!< 0x00008000 */

